# running in std_pipelinestage_formal_prove/src/
read -formal -sv std_pipelinestage_formal.sv
read -formal -sv utils.sv
prep -top std_pipelinestage_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
